---
kind: property
id: P:Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendShowDescription
source: html/5472b957-5012-ea81-cdc1-3d38af41a3f3.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendShowDescription Property

If true legend contains analysis description.

## Syntax (C#)
```csharp
public bool LegendShowDescription { get; set; }
```